user_extend_service/app/controllers/users_controller.rb

  def find
    @user = User.find_by(document_number: params['document_number'])
---
SELECT "users".* FROM "users" WHERE "users"."document_number" = $1 LIMIT $2  [["document_number", "441981"], ["LIMIT", 1]]

  def create
    par = {ticket_number: params['ticket_number'], name: params['name'], age: params['age'], document_number: params['document_number'], document_type: params['document_type']}
    @user = User.new(par)
    @user.save!
---
INSERT INTO "users" ("ticket_number", "name", "age", "document_number", "document_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_user
      @user = User.find_by(ticket_number: params['ticket_number'].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."ticket_number" = $1 LIMIT $2  [["ticket_number", 5], ["LIMIT", 1]]